name: codellama_engine
platform: "tensorrt-llm"
max_batch_size: 128

input [
  { 
    name: "input_ids", 
    data_type: TYPE_INT32, 
    dims: [-1, -1] 
  },
  {
    name: "input_lengths",
    data_type: TYPE_INT32,
    dims: [-1]
  }
]

output [
  { 
    name: "output_ids", 
    data_type: TYPE_INT32, 
    dims: [-1, -1] 
  },
  {
    name: "sequence_length",
    data_type: TYPE_INT32,
    dims: [-1]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]

parameters {
  key: "model_path"
  value: { string_value: "/models/codellama_engine/1" }
}

parameters {
  key: "tokenizer_dir"
  value: { string_value: "/models/codellama_engine/tokenizer" }
}

parameters {
  key: "max_tokens_in_paged_kv_cache"
  value: { string_value: "4096" }
}

dynamic_batching {
  preferred_batch_size: [1, 2, 4, 8, 16, 32, 64, 128]
  max_queue_delay_microseconds: 10000
}
